[
  {
    "_id": "6357cace0d8a1d3611baa0f0",
    "index": 1,
    "picture": "https://contentstatic.techgig.com/photo/90325682.cms",
    "title": "learn C",
    "details":"C is a powerful general-purpose programming language. It can be used to develop software like operating systems, databases, compilers, and so on. C programming is an excellent language to learn to program for beginners"
  },
  {
    "_id": "6357cace78d9e5717ae9a75c",
    "index": 2,
    "picture": "https://banner2.cleanpng.com/20180621/jow/kisspng-plain-old-java-object-programming-language-compute-5b2b6405b39ad9.4848800015295703097357.jpg",
    "title": "learn Java",
    "details":"Java is a general-purpose, class-based, object-oriented programming language designed for having lesser implementation dependencies. It is a computing platform for application development. Java is fast, secure, and reliable, therefore. It is widely used for developing Java applications in laptops, data centers, game consoles, scientific supercomputers, cell phones, etc.."
  },
  {
    "_id": "6357caceaa092610ac487de6",
    "index": 3,
    "picture": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/2048px-Unofficial_JavaScript_logo_2.svg.png",
    "title": "learn Javascript",
    "details":"JavaScript is a powerful and flexible programming language. It can execute on a web browser that allows us to make interactive webpages such as popup menus, animations, form validation, etc."
  },
  {
    "_id": "6357cace9da0d7a293a9cf6a",
    "index": 4,
    "picture": "https://nyesteventuretech.com/images/cpp-programming-logo.jpg",
    "title": "learn C++",
    "details":"C++ is a powerful general-purpose programming language. It can be used to develop operating systems, browsers, games, and so on. C++ supports different ways of programming like procedural, object-oriented, functional, and so on. This makes C++ powerful as well as flexible."
  },
  {
    "_id": "6357cace7f91c196dd717bd0",
    "index": 5,
    "picture": "https://www.avenga.com/wp-content/uploads/2020/11/C-Sharp.png",
    "title": "learn C#",
    "details":"C# is an object-oriented, component-oriented programming language. C# provides language constructs to directly support these concepts, making C# a natural language in which to create and use software components. Since its origin, C# has added features to support new workloads and emerging software design practices. At its core, C# is an object-oriented language. You define types and their behavior."
  },
  {
    "_id": "6357cace68000a1ca103cd2c",
    "index": 6,
    "picture": "https://logos-world.net/wp-content/uploads/2021/10/Python-Symbol.png",
    "title": "learn Python",
    "details":"Python is a popular general-purpose programming language. It is used in machine learning, web development, desktop applications, and many other fields. Fortunately for beginners, Python has a simple, easy-to-use syntax. This makes Python a great language to learn for beginners"
  }
]